pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
/*
 * Copyright(c) 2007 - 2018 Realtek Corporation. All rights reserved.
 * SPDX-License-Identifier: Apache-2.0 
 * Licensed under the Apache License, Version 2.0 (the License); you may 
 * not use this file except in compliance with the License. 
 * You may obtain a copy of the License at 
 * 
 * http://www.apache.org/licenses/LICENSE-2.0 
 * 
 * Unless required by applicable law or agreed to in writing, software 
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT 
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. 
 * See the License for the specific language governing permissions and 
 * limitations under the License.
 *
 * @file     rtl8710c_syson.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     26. April 2019
 * @note     Generated by SVDConv V3.3.13 on Friday, 26.04.2019 20:00:13
 *           from File 'rtl8710c_syson.svd',
 *           last modified on Friday, 26.04.2019 11:55:35
 */

#ifndef RTL8710C_SYSON_H
#define RTL8710C_SYSON_H

#ifdef __cplusplus
extern "C" {
#endif

/// @cond DOXYGEN_SYSON_REG_TYPE

/** @addtogroup hs_hal_syson SysOn Functions
  * @ingroup 8710c_hal
  * @{
  */


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/** @addtogroup hal_syson_reg SysOn Registers
  * @ingroup hs_hal_syson
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           SYSON                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief SOC System Control (SYSON)
  */

typedef struct {                                /*!< (@ 0x40000000) SYSON Structure                                            */
  
  union {
    __IOM uint32_t sys_pwr_iso_ctrl;            /*!< (@ 0x00000000) System Power and Isolation Control Register                */
    
    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t pon_spc_en : 1;            /*!< [8..8] 1:enable peripheral on domain small power cut                      */
      __IOM uint32_t pon_lpc_en : 1;            /*!< [9..9] 1:enable peripheral on domain large power cut                      */
      __IOM uint32_t soc_spc_en : 1;            /*!< [10..10] 1:enable SOC domain small power cut                              */
      __IOM uint32_t soc_lpc_en : 1;            /*!< [11..11] 1:enable SOC domain large power cut                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t sys_iso_peon : 1;          /*!< [16..16] description                                                      */
      __IOM uint32_t sys_iso_ret_mem : 1;       /*!< [17..17] 1: isolation retention memroy to SOC domain; 0: disable
                                                     isolation                                                                 */
      __IOM uint32_t sys_iso_soc : 1;           /*!< [18..18] 1: isolation SOC to PEON domain; 0: disable isolation            */
      __IM  uint32_t            : 2;
      __IOM uint32_t sys_iso_128k_osc : 1;      /*!< [21..21] 1: isolation 128K NCO's input signal to syson; 0:disable
                                                     isolation                                                                 */
      __IOM uint32_t sys_iso_xtal : 1;          /*!< [22..22] 1: isolatino XTAL to SYSON; 0: disable isolation                 */
      __IOM uint32_t sys_iso_syspll : 1;        /*!< [23..23] 1: isolatino SYSPLL to SYSON; 0: disable isolation               */
    } sys_pwr_iso_ctrl_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t sys_func_en;                 /*!< (@ 0x00000008) System Function Control Register                           */
    
    struct {
      __IOM uint32_t sys_fen_eeldr : 1;         /*!< [0..0] 1: enable EE Loader; 0: disable EE loader                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t soc_syspeon_en : 1;        /*!< [4..4] 1: enable SYSTEM to APB0                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t lp_timer_en : 1;           /*!< [6..6] 1: enable Lptimer                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpio_en    : 1;            /*!< [8..8] 1: enable GPIO macro                                               */
      __IOM uint32_t gpio_rst_mux : 1;          /*!< [9..9] 1: Mask WDOG_RST to reset GPIO block                               */
      __IM  uint32_t            : 14;
      __IOM uint32_t sys_fen_sic : 1;           /*!< [24..24] 1: enable SIC function enable; 0: reset                          */
      __IOM uint32_t sys_fen_sic_mst : 1;       /*!< [25..25] 1: enable SIC to access register by CPU                          */
      __IM  uint32_t            : 5;
      __IOM uint32_t sys_amacro_en : 1;         /*!< [31..31] Analog IP PWD_B, REGU hw_pdb_12                                  */
    } sys_func_en_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t sys_clk_ctrl0;               /*!< (@ 0x00000010) System Clock Control Register0                             */
    
