pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t pll_enc_ref_clk_sel : 1;   /*!< [0..0] 0-> select special route , 1-> digital APR                         */
      __IOM uint32_t pll_enc_sp_r_enb : 1;      /*!< [1..1] 0-> enable special route ,1-> disable special route                */
      __IM  uint32_t            : 4;
      __IOM uint32_t pll_enc_ssc_en : 1;        /*!< [6..6] ssc enable. Default=0                                              */
      __IOM uint32_t pll_enc_ssc_freq_sel : 12; /*!< [18..7] ssc freq selection                                                */
      __IOM uint32_t pll_enc_ssc_step_sel : 13; /*!< [31..19] ssc step size selection.                                         */
    } sys_pll_ctrl2_b;
  } ;
  
  union {
    __IOM uint32_t sys_pll_ctrl3;               /*!< (@ 0x0000007C) System PLL Control Register3                               */
    
    struct {
      __IM  uint32_t            : 15;
      __IOM uint32_t pll_enc_sdm_order_sel : 1; /*!< [15..15] SDM order: 0:2nd order, 1:3rd order                              */
      __IOM uint32_t pll_enc_sdm_fon : 3;       /*!< [18..16] N code, feedback divider number 1 for 1/8                        */
      __IOM uint32_t pll_enc_sdm_fof : 13;      /*!< [31..19] F code, feedback divider number 1for 1/8*1/2^13                  */
    } sys_pll_ctrl3_b;
  } ;
  
  union {
    __IOM uint32_t osc128k_ctrl;                /*!< (@ 0x00000080) Osc128K Control Register                                   */
    
    struct {
      __IOM uint32_t sys_128k_en : 1;           /*!< [0..0] POW_128KOSC                                                        */
      __IOM uint32_t sys_128k_ldo_vref_sel : 1; /*!< [1..1] SEL_LDO_VREF                                                       */
      __IM  uint32_t            : 6;
      __IOM uint32_t sys_128k_rcal : 6;         /*!< [13..8] F=128k+(RCAL[5:0]-32)*128k*3_                                     */
    } osc128k_ctrl_b;
  } ;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t sys_32k_sdm_idr_ctrl0;       /*!< (@ 0x00000088) 32K SDM Indirrect Access Control Register0                 */
    
    struct {
      __IOM uint32_t sdm_addr   : 6;            /*!< [5..0] SDM register offset                                                */
      __IM  uint32_t            : 2;
      __IOM uint32_t sdm_en     : 1;            /*!< [8..8] SDM function enable                                                */
      __IOM uint32_t sdm_clk_en : 1;            /*!< [9..9] SDM Pclk enable                                                    */
    } sys_32k_sdm_idr_ctrl0_b;
  } ;
  
  union {
    __IOM uint32_t sys_32k_sdm_idr_ctrl1;       /*!< (@ 0x0000008C) 32K SDM Indirrect Access Control Register1                 */
    
    struct {
      __IOM uint32_t ls_sdm_data : 32;          /*!< [31..0] SDM register data, support byte write                             */
    } sys_32k_sdm_idr_ctrl1_b;
  } ;
  __IM  uint32_t  RESERVED7[4];
  
  union {
    __IM  uint32_t xtal_aac_dbg;                /*!< (@ 0x000000A0) XTAL AAC Debugging Register                                */
    
    struct {
      __IM  uint32_t xtal_aac_rdy : 1;          /*!< [0..0] xtal_aac_rdy                                                       */
      __IM  uint32_t xtal_aac_dbg : 3;          /*!< [3..1] xtal_aac_dbg                                                       */
      __IM  uint32_t xtal_aac_state : 4;        /*!< [7..4] xtal_aac_state                                                     */
      __IM  uint32_t xtal_aac_done : 16;        /*!< [23..8] xtal_aac_done                                                     */
      __IM  uint32_t xtal_gm_out : 5;           /*!< [28..24] xtal_gm_out                                                      */
      __IM  uint32_t            : 2;
      __IM  uint32_t xtal_pkdet_out : 1;        /*!< [31..31] xtal_pkdet_out                                                   */
    } xtal_aac_dbg_b;
  } ;
  
  union {
    __IM  uint32_t sys_debug_reg;               /*!< (@ 0x000000A4) System Debugging Register                                  */
    
    struct {
      __IM  uint32_t sys_dbg_value : 32;        /*!< [31..0] SYS debug register value. 0x30[7:0] select the debug
                                                     port                                                                      */
    } sys_debug_reg_b;
  } ;
  __IM  uint32_t  RESERVED8;
  
  union {
    __IOM uint32_t pad_ctrl;                    /*!< (@ 0x000000AC) IO Pad Control Register                                    */
    
    struct {
      __IOM uint32_t gpiog_a_s_shdn : 1;        /*!< [0..0] GPIOA 3, 4, 6-12. PAD enable, 1: enable PAD, 0: shutdown           */
      __IOM uint32_t gpiog_a_f_shdn : 1;        /*!< [1..1] GPIOA 13, 16, 17, 18, 21, 22., PAD enable 1: enable PAD,
                                                     0: shutdown                                                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t gpioga_rstb33 : 1;         /*!< [4..4] 0: reset GPIO group A pull control                                 */
      __IOM uint32_t gpioga_h3l1_ctrl0 : 1;     /*!< [5..5] IO pad power voltage of GPIO A0-12 0:1.8V; 1:3.3V                  */
      __IOM uint32_t gpioga_h3l1_ctrl1 : 1;     /*!< [6..6] IO pad power voltage of GPIO A15-23 0:1.8V; 1:3.3V                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiog_b_shdn : 1;          /*!< [8..8] PAD enable, 1: enable PAD, 0: shutdown                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiogb_rstb33 : 1;         /*!< [12..12] 0: reset GPIO group B pull control                               */
      __IOM uint32_t gpiogb_h3l1 : 1;           /*!< [13..13] GPIO_B 3.3V IO pad input voltage level of High: 0:1.8V;
                                                     1:3.3V                                                                    */
      __IM  uint32_t            : 2;
      __IOM uint32_t vd5v_sel   : 1;            /*!< [16..16] select the Power source from REGU,1: 5V_LDO_IN, 0:
                                                     5V_LDO_OUT                                                                */
      __IOM uint32_t io5v_h5l3  : 1;            /*!< [17..17] 5V IO pad input voltage level of High: 0: 3.3V; 1:
                                                     5V                                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t trap_shdn  : 1;            /*!< [24..24] A0,1,2,5,23 PAD enable, 1: enable PAD, 0: shutdown               */
    } pad_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa0_1_ctrl;               /*!< (@ 0x000000B0) GPIOA0 and GPIOA1 Control Register                         */
    
