pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t gpioa0_pinmux_sel : 3;     /*!< [2..0] 000: Reserved 001: JTAG_CLK 010: UART1_IN 011: EXT_32K
                                                     100: SIC_SCL 101: PMM0 110: WL_UART_IN 111: GPIO                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa0_pull_ctrl_1_0 : 2;  /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa0_smt_en : 1;         /*!< [9..9] Enable GPIOA0 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpioa0_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa1_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: JTAG_TMS 010: UART1_OUT 011: BT_led
                                                     100: SIC_DA 101: PWM1 110: WL_UART_OUT 111: GPIO                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa1_pull_ctrl_1_0 : 2;  /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa1_smt_en : 1;         /*!< [25..25] Enable GPIOA1 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpioa1_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa0_1_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa2_3_ctrl;               /*!< (@ 0x000000B4) GPIOA2 and GPIOA3 Control Register                         */
    
    struct {
      __IOM uint32_t gpioa2_pinmux_sel : 3;     /*!< [2..0] 000: 001: JTAG_TDO 010: UART1_IN 011: SPI_CS 100: I2C0_SCL
                                                     101: PWM2 110: 111: GPIO                                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa2_pull_ctrl_1_0 : 2;  /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa2_smt_en : 1;         /*!< [9..9] Enable GPIOA2 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpioa2_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa3_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: JTAG_TDI 010: UART1_OUT 011: SPI_SCL
                                                     100: I2C0_SDA 101: PWM3 110: reserved 111: GPIO                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa3_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa3_smt_en : 1;         /*!< [25..25] Enable GPIOA3 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpioa3_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa2_3_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa4_5_ctrl;               /*!< (@ 0x000000B8) GPIO A4 and GPIO A5 Control Register                       */
    
    struct {
      __IOM uint32_t gpioa4_pinmux_sel : 3;     /*!< [2..0] 000: Reserved 001: JTAG_TRST 010: UART1_CTS 011: SPI_MOSI
                                                     100: Reserved 101: PWM4 110: Reserved 111: GPIO                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa4_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa4_smt_en : 1;         /*!< [9..9] Enable GPIOA4 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpioa4_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa5_pinmux_sel : 3;     /*!< [18..16] 000: 001: 010: UART1_RTS 011: SPI_MISO 100: 101: PWM5
                                                     110: 111: GPIO                                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa5_pull_ctrl_1_0 : 2;  /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa5_smt_en : 1;         /*!< [25..25] Enable GPIOA5 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpioa5_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa4_5_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa6_7_ctrl;               /*!< (@ 0x000000BC) GPIO A6 and GPIO A7 Control Register                       */
    
