pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t gpioa6_pinmux_sel : 3;     /*!< [2..0] 000: reserved 001: reserved 010: reserved 011: reserved
                                                     100: reserved 101: PWM6 110: reserved 111: GPIO                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa6_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa6_smt_en : 1;         /*!< [9..9] Enable GPIOA6 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpioa6_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa7_pinmux_sel : 3;     /*!< [18..16] 000: SPI_M_CS 001: Reserved 010: Reserved 011: SPI_CS
                                                     100: Reserved 101: Reserved 110: Reserved 111: GPIO                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa7_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa7_smt_en : 1;         /*!< [25..25] Enable GPIOA7 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpioa7_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa6_7_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa8_9_ctrl;               /*!< (@ 0x000000C0) GPIO A8 and GPIO A9 Control Register                       */
    
    struct {
      __IOM uint32_t gpioa8_pinmux_sel : 3;     /*!< [2..0] 000: SPI_M_CLK 001: Reserved 010: Reserved 011: SPI_CLK
                                                     100: Reserved 101: Reserved 110: Reserved 111: GPIO                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa8_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa8_smt_en : 1;         /*!< [9..9] Enable GPIOA8 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpioa8_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa9_pinmux_sel : 3;     /*!< [18..16] 000: SPI_M_D2 001: Reserved 010: UART0_RTS 011: SPI_MOSI
                                                     100: Reserved 101: Reserved 110: Reserved 111: GPIO                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa9_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa9_smt_en : 1;         /*!< [25..25] Enable GPIOA9 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpioa9_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa8_9_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa10_11_ctrl;             /*!< (@ 0x000000C4) GPIO A10 and GPIO A11 Control Register                     */
    
    struct {
      __IOM uint32_t gpioa10_pinmux_sel : 3;    /*!< [2..0] 000: SPI_M_D1 001: Reserved 010: UART0_CTS 011: SPI_MISO
                                                     100: Reserved 101: Reserved 110: BT_I2C_SCL 111: GPIO                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa10_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa10_smt_en : 1;        /*!< [9..9] Enable GPIOA10 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpioa10_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa11_pinmux_sel : 3;    /*!< [18..16] 000: SPI_M_D0 001: Reserved 010: UART0_OUT 011: Reserved
                                                     100: I2C0_SCL 101: PWM0 110: BT_I2C_SDA 111: GPIO                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa11_pull_ctrl : 2;     /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa11_smt_en : 1;        /*!< [25..25] Enable GPIOA11 Schmitt trigger; 1: enable                        */
      __IOM uint32_t gpioa11_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa10_11_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa12_13_ctrl;             /*!< (@ 0x000000C8) GPIO A12 and GPIO A13 Control Register                     */
    
