pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t gpioa12_pinmux_sel : 3;    /*!< [2..0] 000: SPI_M_D3 001: Reserved 010: UART0_IN 011: Reserved
                                                     100: I2C0_SDA 101: PWM1 110: Reserved 111: GPIO                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa12_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa12_smt_en : 1;        /*!< [9..9] Enable GPIOA12 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpioa12_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa13_pinmux_sel : 3;    /*!< [18..16] 000: Reserved 001: Reserved 010: UART0_IN 011: Reserved
                                                     100: Reserved 101: PWM7 110: Reserved 111: GPIO                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa13_pull_ctrl : 2;     /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa13_smt_en : 1;        /*!< [25..25] Enable GPIOA13 Schmitt trigger; 1: enable                        */
      __IOM uint32_t gpioa13_driving : 2;       /*!< [27..26] (E2)= 3.3V: 0: 4mA; 1: 8mA; 5V: 0: 4mA; 1: 8mA;                  */
    } gpioa12_13_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa14_15_ctrl;             /*!< (@ 0x000000CC) GPIO A14 and GPIO A15 Control Register                     */
    
    struct {
      __IOM uint32_t gpioa14_pinmux_sel : 3;    /*!< [2..0] 000 : SDIO_INT 001: Reserved 010: UART0_OUT 011: Reserved
                                                     100: Reserved 101: PWM2 110: BT_LOG 111: GPIO                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa14_pull_ctrl_1_0 : 2; /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IOM uint32_t gpioa14_shdn_n : 1;        /*!< [8..8] PAD enable, 1: enable PAD, 0: shutdown                             */
      __IOM uint32_t gpioa14_smt_en : 1;        /*!< [9..9] Enable GPIOA14 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpioa14_driving : 2;       /*!< [11..10] (E2)= 3.3V: 0: 4mA; 1: 8mA; 5V: 0: 4mA; 1: 8mA;                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa15_pinmux_sel : 3;    /*!< [18..16] 000: SD_D2 001: SPI_M_CS 010: UART2_IN 011: SPI_CS
                                                     100: I2C0_SCL 101: PWM3 110: BT_UART_IN 111: GPIO                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa15_pull_ctrl_1_0 : 2; /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IOM uint32_t gpioa15_shdn_n : 1;        /*!< [24..24] PAD enable, 1: enable PAD, 0: shutdown                           */
      __IOM uint32_t gpioa15_smt_en : 1;        /*!< [25..25] Enable GPIOA15 Schmitt trigger; 1: enable                        */
      __IOM uint32_t gpioa15_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa14_15_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa16_17_ctrl;             /*!< (@ 0x000000D0) GPIO A16 and GPIO A17 Control Register                     */
    
    struct {
      __IOM uint32_t gpioa16_pinmux_sel : 3;    /*!< [2..0] 000: SD_D3 001: SPI_M_CLK 010: UART2_OUT 011: SPI_SCL
                                                     100: I2C0_SDA 101: PWM4 110: BT_UART_OUT 111: GPIO                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa16_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa16_smt_en : 1;        /*!< [9..9] Enable GPIOA16 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpioa16_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa17_pinmux_sel : 3;    /*!< [18..16] 000: SD_CMD 001: SPI_M_D0 010: Reserved 011: Reserved
                                                     100: Reserved 101: PWM5 110: Reserved 111: GPIO                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa17_pull_ctrl : 2;     /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa17_smt_en : 1;        /*!< [25..25] Enable GPIOA17 Schmitt trigger; 1: enable                        */
      __IOM uint32_t gpioa17_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa16_17_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa18_19_ctrl;             /*!< (@ 0x000000D4) GPIO A18 and GPIO A19 Control Register                     */
    
