pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t gpioa18_pinmux_sel : 3;    /*!< [2..0] 000: SD_CLK 001: SPI_M_D1 010: Reserved 011: Reserved
                                                     100: Reserved 101: PWM6 110: Reserved 111: GPIO                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa18_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa18_smt_en : 1;        /*!< [9..9] Enable GPIOA18 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpioa18_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa19_pinmux_sel : 3;    /*!< [18..16] 000: SD_D0 001: SPI_M_D2 010: UART2_CTS 011: SPI_MOSI
                                                     100: I2C0_SCL 101: PWM7 110: 111: GPIO                                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa19_pull_ctrl_1_0 : 2; /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IOM uint32_t gpioa19_shdn_n : 1;        /*!< [24..24] PAD enable, 1: enable PAD, 0: shutdown                           */
      __IOM uint32_t gpioa19_smt_en : 1;        /*!< [25..25] Enable GPIOA19 Schmitt trigger; 1: enable                        */
      __IOM uint32_t gpioa19_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa18_19_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa20_21_ctrl;             /*!< (@ 0x000000D8) GPIO A20 and GPIO A21 Control Register                     */
    
    struct {
      __IOM uint32_t gpioa20_pinmux_sel : 3;    /*!< [2..0] 000: SD_D1 001:SPI_M_D3 010: UART2_RTS 011: SPI_MISO
                                                     100: I2C0_SDA 101: PWM0 110: reserv 111: GPIO                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa20_pull_ctrl_1_0 : 2; /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IOM uint32_t gpioa20_shdn_n : 1;        /*!< [8..8] PAD enable, 1: enable PAD, 0: shutdown                             */
      __IOM uint32_t gpioa20_smt_en : 1;        /*!< [9..9] Enable GPIOA20 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpioa20_driving : 2;       /*!< [11..10] 1: 16mA 0: 8mA                                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa21_pinmux_sel : 3;    /*!< [18..16] 000: Reserved 001: Reserved 010: UART2_IN 011: Reserved
                                                     100: I2C0_SCL 101: PWM1 110: RFE_CTRL0 111: GPIO                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa21_pull_ctrl : 2;     /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa21_smt_en : 1;        /*!< [25..25] Enable GPIOA21 Schmitt trigger; 1: enable                        */
      __IOM uint32_t gpioa21_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa20_21_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpioa22_23_ctrl;             /*!< (@ 0x000000DC) GPIO A22 and GPIO A23 Control Register                     */
    
    struct {
      __IOM uint32_t gpioa22_pinmux_sel : 3;    /*!< [2..0] 000: Reserved 001: Reserved 010: UART2_OUT 011: LED0
                                                     100: I2C0_SDA 101: PWM2 110: RFE_CTRL1 111: GPIO                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa22_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa22_smt_en : 1;        /*!< [9..9] Enable GPIOA22 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpioa22_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpioa23_pinmux_sel : 3;    /*!< [18..16] 000: Reserved 001: Reserved 010: Reserved 011: LED0
                                                     100: Reserved 101: PWM7 110: RFE_CTRL2 111: GPIO                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpioa23_pull_ctrl_1_0 : 2; /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpioa23_smt_en : 1;        /*!< [25..25] Enable GPIOA23 Schmitt trigger; 1: enable                        */
      __IOM uint32_t gpioa23_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpioa22_23_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t sys_eeprom_ctrl0;            /*!< (@ 0x000000E0) System EEPROM Control Register                             */
    
