pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t sys_autoload_sus : 1;      /*!< [5..5] 1: Autoload successful 0: Autoload fail                            */
      __IM  uint32_t            : 10;
      __IOM uint32_t sys_efuse_ldall : 1;       /*!< [16..16] 1: SW enable HWSM to autoload excluding Efuse 0x00~
                                                     0x31                                                                      */
      __IM  uint32_t            : 7;
      __IOM uint32_t efuse_pgpwd : 8;           /*!< [31..24] Efuse Program password, write 0x69 for programing                */
    } sys_eeprom_ctrl0_b;
  } ;
  __IM  uint32_t  RESERVED9;
  
  union {
    __IOM uint32_t sys_efuse_ctrl;              /*!< (@ 0x000000E8) System eFuse Control Register                              */
    
    struct {
      __IOM uint32_t sys_ef_data : 8;           /*!< [7..0] Access Data                                                        */
      __IOM uint32_t sys_ef_addr : 10;          /*!< [17..8] Access Address                                                    */
      __IOM uint32_t sys_ef_alden : 1;          /*!< [18..18] Autoload Enable                                                  */
      __IOM uint32_t sys_ef_pdwn : 1;           /*!< [19..19] Efuse power down                                                 */
      __IOM uint32_t sys_ef_tpg2avdd : 2;       /*!< [21..20] Tsp_pg_avdd 00:1000ns, 01:1250ns, 10:1500ns 11:1750ns.
                                                     (CLK freq: 4M)                                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t sys_ef_tstrobe : 3;        /*!< [26..24] Tstrobe (AEN width) 000: 7000ns, 001:8000ns, 010: 9000ns,
                                                     011: 10000ns,100:11000ns, 101:12000ns, 110: 13000ns, 111:14000ns.
                                                     (CLK freq: 4Mhz)                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t sys_ef_tgap : 2;           /*!< [29..28] 00: 2000ns, 01:2250ns, 10:2500ns, 11:2750ns. (CLK freq:
                                                     4Mhz)                                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t sys_ef_rwflag : 1;         /*!< [31..31] Write 1 for Program; Write 0 for Read Access                     */
    } sys_efuse_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t sys_efuse_test;              /*!< (@ 0x000000EC) eFuse Test Register                                        */
    
    struct {
      __IOM uint32_t sys_ef_scan_tthd : 7;      /*!< [6..0] Bit number for all cells scan test                                 */
      __IOM uint32_t sys_ef_trpt : 1;           /*!< [7..7] Test Scan Report: 1 : Fail, 0 : OK                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t sys_ef_force_pgmen : 1;    /*!< [11..11] SW force PGMEN input of efuse to high. (for the bank
                                                     selected by 0x34[9:8])                                                    */
      __IOM uint32_t sys_ef_scan_end : 4;       /*!< [15..12] Residual bytes Setting for SCAN (0~15)                           */
      __IOM uint32_t sys_ef_scan_start : 9;     /*!< [24..16] SCAN start Address (unit in byte)                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t sys_ef_cres_sel : 1;       /*!< [26..26] Efuse CRES selection, 0: 10k ; 1: 1.5k                           */
    } sys_efuse_test_b;
  } ;
  
  union {
    __IOM uint32_t sys_sw_reserv0;              /*!< (@ 0x000000F0) SW reserved Register0                                      */
    
    struct {
      __IOM uint32_t sw_resv0   : 32;           /*!< [31..0] SW reserved register0                                             */
    } sys_sw_reserv0_b;
  } ;
  
  union {
    __IOM uint32_t sys_sw_reserv1;              /*!< (@ 0x000000F4) SW reserved Register1                                      */
    
    struct {
      __IOM uint32_t sw_resv1   : 32;           /*!< [31..0] SW reserved register1                                             */
    } sys_sw_reserv1_b;
  } ;
  
  union {
    __IOM uint32_t sys_sw_reserv2;              /*!< (@ 0x000000F8) SW reserved Register2                                      */
    
    struct {
      __IOM uint32_t sw_resv2   : 32;           /*!< [31..0] SW reserved register2                                             */
    } sys_sw_reserv2_b;
  } ;
  
  union {
    __IOM uint32_t sys_sw_reserv3;              /*!< (@ 0x000000FC) SW reserved Register3                                      */
    
    struct {
      __IOM uint32_t sw_resv3   : 32;           /*!< [31..0] SW reserved register3                                             */
    } sys_sw_reserv3_b;
  } ;
  
  union {
    __IOM uint32_t sys_slp_wake_event_msk0;     /*!< (@ 0x00000100) System Wake Up Event Mask Register                         */
    
    struct {
      __IOM uint32_t syson_wevt_lpgtim_msk : 1; /*!< [0..0] 1: enable LP Timer Wakeup SYSON event; 0: disable the
                                                     event to wakeup system                                                    */
      __IOM uint32_t syson_wevt_hsgtim_msk : 1; /*!< [1..1] 1: enable HSGtimer Wakeup SYSON event; 0: disable the
                                                     event to wakeup system                                                    */
      __IOM uint32_t syson_wevt_over_current_msk : 1;/*!< [2..2] 1: enable OCP wakeup event; 0: disable the event to wakeup
                                                     system                                                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t syson_wevt_gpio_int_msk : 1;/*!< [4..4] 1: enable GPIO interrupt Wakeup event; 0: disable the
                                                     event to wakeup system                                                    */
      __IOM uint32_t syson_wevt_pwm_msk : 1;    /*!< [5..5] 1: enable PWM Wakeup event; 0: disable the event to wakeup
                                                     system                                                                    */
      __IOM uint32_t syson_wevt_i2c0_addr_macth_msk : 1;/*!< [6..6] 1:enable wakeup event of I2C0 RX address match             */
      __IM  uint32_t            : 1;
      __IOM uint32_t syson_wevt_wlan_msk : 1;   /*!< [8..8] 1: enable WLAN Wakeup event; 0: disable the event to
                                                     wakeup system                                                             */
      __IOM uint32_t syson_wevt_i2c0_msk : 1;   /*!< [9..9] 1: enable I2C0 Wakeup event; 0: disable the event to
                                                     wakeup system                                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t syson_wevt_uart_msk : 1;   /*!< [11..11] 1: enable UART Wakeup event; 0: disable the event to
                                                     wakeup system All UART0 ~ UART3 (including BT UART) wake
                                                     events are combined to 1 event for PMU.                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t syson_wevt_sdio_msk : 1;   /*!< [14..14] 1: enable SDIO Wakeup event; 0: disable the event to
                                                     wakeup system                                                             */
      __IM  uint32_t            : 15;
      __IOM uint32_t syson_wevt_bor2_msk : 1;   /*!< [30..30] 1: enable brown out reset Wakeup event; 0: disable
                                                     the event to wakeup system                                                */
    } sys_slp_wake_event_msk0_b;
  } ;
  __IM  uint32_t  RESERVED10;
  
  union {
    __IOM uint32_t sys_slp_wake_event_status0;  /*!< (@ 0x00000108) System Wake Up Event Status Register                       */
    
