pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t syson_wevt_lpgtim_sts : 1; /*!< [0..0] 1: Indicate SYSON LPTimer Wakeup SYSON event status;
                                                     Write 1 to clear.                                                         */
      __IM  uint32_t syson_wevt_hsgtim_sts : 1; /*!< [1..1] 1: Indicate HSGtimer Wakeup SYSON event;                           */
      __IOM uint32_t syson_wevt_over_current_sts : 1;/*!< [2..2] 1: Indicate OCP event status, write 1 to clear.               */
      __IM  uint32_t            : 1;
      __IM  uint32_t syson_wevt_gpio_int_sts : 1;/*!< [4..4] 1: Indicate GPIO interrupt Wakeup event;                          */
      __IM  uint32_t syson_wevt_pwm_sts : 1;    /*!< [5..5] 1: indicate PWM Wakeup event                                       */
      __IM  uint32_t syson_wevt_i2c0_addr_macth_sts : 1;/*!< [6..6] 1:inidcate wakeup event of I2C0 RX address match           */
      __IM  uint32_t            : 1;
      __IM  uint32_t syson_wevt_wlan_sts : 1;   /*!< [8..8] 1: enable WLAN Wakeup event; 0: disable the event to
                                                     wakeup system                                                             */
      __IM  uint32_t syson_wevt_i2c0_sts : 1;   /*!< [9..9] 1: indicate I2C0 Wakeup event                                      */
      __IM  uint32_t            : 1;
      __IM  uint32_t syson_wevt_uart_sts : 1;   /*!< [11..11] 1: indicate UART Wakeup event All UART0 ~ UART3 (including
                                                     BT UART) wake events are combined to 1 event for PMU.                     */
      __IM  uint32_t            : 2;
      __IM  uint32_t syson_wevt_sdio_sts : 1;   /*!< [14..14] 1: indicate SDIO Wakeup event                                    */
      __IM  uint32_t            : 15;
      __IOM uint32_t syson_wevt_bor2_sts : 1;   /*!< [30..30] Brown out reset status, write 1 to clear.                        */
    } sys_slp_wake_event_status0_b;
  } ;
  __IM  uint32_t  RESERVED11[2];
  
  union {
    __IOM uint32_t sys_snf_wake_event_status;   /*!< (@ 0x00000114) System Sniff Mode Wake Up Event Status Register            */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t syson_snfevt_wlon_pon_sts : 1;/*!< [1..1] 1: indicate wlan power on wakeup status                         */
    } sys_snf_wake_event_status_b;
  } ;
  
  union {
    __IOM uint32_t sys_pwrmgt_ctrl;             /*!< (@ 0x00000118) System Power Management Register                           */
    
    struct {
      __IOM uint32_t syson_pm_cmd_dslp : 1;     /*!< [0..0] 1: command SYSON SM to enter deep sleep state,when PMC
                                                     finishes the process, this bit will be auto clear to 0                    */
      __IOM uint32_t syson_pm_cmd_slp : 1;      /*!< [1..1] 1: command SYSON SM to enter sleep state, when PMC finishes
                                                     the process, this bit will be auto clear to 0                             */
    } sys_pwrmgt_ctrl_b;
  } ;
  __IM  uint32_t  RESERVED12;
  
  union {
    __IOM uint32_t sys_pwrmgt_option;           /*!< (@ 0x00000120) System Power Management Option Register                    */
    
    struct {
      __IM  uint32_t            : 9;
      __IOM uint32_t syson_pmopt_slp_en_swr : 1;/*!< [9..9] 1: power enable SWR/LDO 1.2V when enter into sleep mode;
                                                     0: disable SWR/LDO                                                        */
      __IOM uint32_t syson_pmopt_slp_en_pwm : 1;/*!< [10..10] 1: power enable SWR/LDO output heavy loading current
                                                     mode when enter into sleep mode; 0: disable SWR/LDO output
                                                     heavy loading mode                                                        */
      __IOM uint32_t syson_pmopt_slp_en_soc : 1;/*!< [11..11] 1: power enable SOC platform when enter into sleep
                                                     mode; 0: power off SoC domain                                             */
      __IOM uint32_t syson_pmopt_slp_xtal_en : 1;/*!< [12..12] 1: enable XTAL when enter into sleep mode; 0: disable
                                                     XTAL                                                                      */
      __IOM uint32_t syson_pmopt_slp_syspll_en : 1;/*!< [13..13] 1: enable syspem PLL when enter into sleep mode; 0:
                                                     disable SYSPLL                                                            */
      __IOM uint32_t syson_pmopt_slp_mem_pm_en : 1;/*!< [14..14] 0: Enable memory DS mode when enter into power mode
                                                     ; 1: memory normal mode when enter into power mode                        */
      __IOM uint32_t syson_pmopt_slp_5vldo_mediumld_en : 1;/*!< [15..15] 0: enable 5VLDO medium load when enter into sleep mode,
                                                     0x44[11:10] = 2b'01; 1: do not change                                     */
      __IOM uint32_t syson_pmopt_slp_5vldo_lightld_en : 1;/*!< [16..16] 0: enable 5VLDO light load when enter into sleep mode,
                                                     0x44[11:10] = 2b'11; 1: do not change                                     */
      __IOM uint32_t syson_pmopt_snz_en_swr : 1;/*!< [17..17] 1: power enable SWR/LDO 1.2V when enter into snooze
                                                     mode; 0: disable SWR/LDO                                                  */
      __IOM uint32_t syson_pmopt_snz_en_pwm : 1;/*!< [18..18] 1: power enable SWR/LDO output heavy loading current
                                                     mode when enter into snooze mode; 0: disable SWR/LDO output
                                                     heavy loading mode                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t syson_pmopt_snz_xtal_en : 1;/*!< [20..20] 1: enable XTAL when enter into snooze mode; 0: disable
                                                     XTAL                                                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t syson_pmopt_snz_5vldo_normal_en : 1;/*!< [23..23] 0: enable 5VLDO medium load when enter into snooze
                                                     mode, 0x44[11:10] = 2b'00; 1: do not change                               */
      __IOM uint32_t syson_pmopt_snz_5vldo_mediumld_en : 1;/*!< [24..24] 0: enable 5VLDO medium load when enter into snooze
                                                     mode, 0x44[11:10] = 2b'01 ; 1: do not change                              */
    } sys_pwrmgt_option_b;
  } ;
  
  union {
    __IOM uint32_t sys_pwrmgt_option_ext;       /*!< (@ 0x00000124) System Power Management Extension Option Register          */
    
