pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t syson_pmopt_slp_anack_en : 1;/*!< [1..1] 1: enable syson register clock when enter into sleep
                                                     mode; 0: disable syson register clock                                     */
      __IOM uint32_t syson_pmopt_slp_anack_sel : 1;/*!< [2..2] 1: set ANA clock to 4MHz when enter into power mode;
                                                     0: set ANA clock to 250KHz when enter into power mode;                    */
    } sys_pwrmgt_option_ext_b;
  } ;
  __IM  uint32_t  RESERVED13[4];
  
  union {
    __IOM uint32_t non_reset_ff;                /*!< (@ 0x00000138) non-Reset Flags                                            */
    
    struct {
      __IOM uint32_t cpu_reset_flag : 1;        /*!< [0..0] IF cup reset happened, this flag will set to 1 by HW               */
      __IOM uint32_t bor2_flag  : 1;            /*!< [1..1] If BOR2(voltage detection?)happened, this flag will set
                                                     to 1 by HW                                                                */
      __IOM uint32_t rtc_restore : 1;           /*!< [2..2] SW used 1. RTC year have backup before reboot                      */
      __IOM uint32_t uartburn_boot : 1;         /*!< [3..3] ROM code used 1. enable UART download before reboot;
                                                     0: disable                                                                */
      __IOM uint32_t uartburn_debug : 1;        /*!< [4..4] ROM code used 1. enable UART download debug; 0: disable            */
      __IM  uint32_t            : 2;
      __IOM uint32_t sys_bor2_en : 1;           /*!< [7..7] 1: enable bor2 detection; 0: disable                               */
    } non_reset_ff_b;
  } ;
  __IM  uint32_t  RESERVED14[5];
  
  union {
    __IOM uint32_t gpiob0_1_ctrl;               /*!< (@ 0x00000150) GPIO B0 and GPIO B1 Control Register                       */
    
    struct {
      __IOM uint32_t gpiob0_pinmux_sel : 3;     /*!< [2..0] 000: Reserved 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_RSTB                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob0_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob0_smt_en : 1;         /*!< [9..9] Enable GPIOB0 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpiob0_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpiob1_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_D0                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob1_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob1_smt_en : 1;         /*!< [25..25] Enable GPIOB1 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpiob1_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpiob0_1_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpiob2_3_ctrl;               /*!< (@ 0x00000154) GPIO B2 and GPIO B3 Control Register                       */
    
    struct {
      __IOM uint32_t gpiob2_pinmux_sel : 3;     /*!< [2..0] 000: Reserved 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_D1                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob2_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob2_smt_en : 1;         /*!< [9..9] Enable GPIOB2 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpiob2_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpiob3_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_D2                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob3_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob3_smt_en : 1;         /*!< [25..25] Enable GPIOB3 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpiob3_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpiob2_3_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpiob4_5_ctrl;               /*!< (@ 0x00000158) GPIO B4 and GPIO B5 Control Register                       */
    
