pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t gpiob4_pinmux_sel : 3;     /*!< [2..0] 000: Reserved 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_D3                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob4_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob4_smt_en : 1;         /*!< [9..9] Enable GPIOB4 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpiob4_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpiob5_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_CS                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob5_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob5_smt_en : 1;         /*!< [25..25] Enable GPIOB5 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpiob5_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpiob4_5_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpiob6_7_ctrl;               /*!< (@ 0x0000015C) GPIO B6 and GPIO B7 Control Register                       */
    
    struct {
      __IOM uint32_t gpiob6_pinmux_sel : 3;     /*!< [2..0] 000: SPI_M_D2 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_CK                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob6_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob6_smt_en : 1;         /*!< [9..9] Enable GPIOB6 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpiob6_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpiob7_pinmux_sel : 3;     /*!< [18..16] 000: SPI_M_D1 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_CK                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob7_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob7_smt_en : 1;         /*!< [25..25] Enable GPIOB7 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpiob7_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpiob6_7_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpiob8_9_ctrl;               /*!< (@ 0x00000160) GPIO B8 and GPIO B9 Control Register                       */
    
    struct {
      __IOM uint32_t gpiob8_pinmux_sel : 3;     /*!< [2..0] 000: SPI_M_CS 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_D4                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob8_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob8_smt_en : 1;         /*!< [9..9] Enable GPIOB8 Schmitt trigger; 1: enable                           */
      __IOM uint32_t gpiob8_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpiob9_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_D5                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob9_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob9_smt_en : 1;         /*!< [25..25] Enable GPIOB9 Schmitt trigger; 1: enable                         */
      __IOM uint32_t gpiob9_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpiob8_9_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpiob10_11_ctrl;             /*!< (@ 0x00000164) GPIO B10 and GPIO B11 Control Register                     */
    
