pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t gpiob10_pinmux_sel : 3;    /*!< [2..0] 000: SPI_M_D3 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_D6                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob10_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob10_smt_en : 1;        /*!< [9..9] Enable GPIOB10 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpiob10_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t gpiob11_pinmux_sel : 3;    /*!< [18..16] 000: SPI_M_CLK 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_D7                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob11_pull_ctrl : 2;     /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                     high; 2b'11: reserved                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob11_smt_en : 1;        /*!< [25..25] Enable GPIOB11 Schmitt trigger; 1: enable                        */
      __IOM uint32_t gpiob11_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpiob10_11_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t gpiob12_ctrl;                /*!< (@ 0x00000168) GPIO B10 and GPIO B11 Control Register                     */
    
    struct {
      __IOM uint32_t gpiob12_pinmux_sel : 3;    /*!< [2..0] 000: SPI_M_D0 001: Reserved 010: Reserved 011: Reserved
                                                     100: Reserved 101: Reserved 110: Reserved 111: LPC_RWDS                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t gpiob12_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                     2b'11: reserved                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t gpiob12_smt_en : 1;        /*!< [9..9] Enable GPIOB12 Schmitt trigger; 1: enable                          */
      __IOM uint32_t gpiob12_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                     8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    } gpiob12_ctrl_b;
  } ;
  __IM  uint32_t  RESERVED15[31];
  
  union {
    __IOM uint32_t test_ctrl;                   /*!< (@ 0x000001E8) Test Control Register                                      */
    
    struct {
      __IOM uint32_t pll_bypass_en : 1;         /*!< [0..0] 1: enable PLL_BYPASS in test mode                                  */
      __IOM uint32_t scan_compression_en : 1;   /*!< [1..1] 1: enable scan compression                                         */
    } test_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t test_mux_ctrl;               /*!< (@ 0x000001EC) Test Mux Control Register                                  */
    
    struct {
      __IOM uint32_t scan_mod0_en : 1;          /*!< [0..0] 1: enable CP scan test mux                                         */
      __IOM uint32_t scan_mod1_en : 1;          /*!< [1..1] 1: enable FT1 scan test mux                                        */
      __IOM uint32_t scan_mod2_en : 1;          /*!< [2..2] 1: enable FT2 scan test mux                                        */
      __IM  uint32_t            : 5;
      __IOM uint32_t mbist_en   : 1;            /*!< [8..8] 1: enable MBIST test mux                                           */
      __IM  uint32_t            : 7;
      __IOM uint32_t regu_test_mux_en : 1;      /*!< [16..16] 1: enable REGU test mux                                          */
      __IOM uint32_t rfafe_test_mux_en : 1;     /*!< [17..17] 1: enable RFAFE test mux                                         */
      __IOM uint32_t pll_test_mux_en : 1;       /*!< [18..18] 1: enable PLL test mux                                           */
    } test_mux_ctrl_b;
  } ;
  
  union {
    __IM  uint32_t sys_system_cfg0;             /*!< (@ 0x000001F0) System Configuration Register0                             */
    
    struct {
      __IM  uint32_t rf_rl_id   : 4;            /*!< [3..0] Vendor ID defined in RF                                            */
      __IM  uint32_t chip_ver   : 4;            /*!< [7..4] Chip version: 0000 : A-cut 0001 : B-cut 0010 : C-cut
                                                     0011 : D-cut ...e.t.c.                                                    */
      __IM  uint32_t vendor_id  : 4;            /*!< [11..8] BIT_VENDOR_ID[3:2] : Process 00: TSMC , 01: SMIC, 10:
                                                     UMC BIT_VENDOR_ID[1] : rsve BIT_VENDOR_ID[0] : 0 : BT do
                                                     not exist in IC 1 : BT exist in IC                                        */
      __IM  uint32_t            : 4;
      __IM  uint32_t chip_type  : 1;            /*!< [16..16] 1: Test chip; 0:MP                                               */
      __IM  uint32_t            : 7;
      __IM  uint32_t bd_opt0    : 1;            /*!< [24..24] BD_OPT0                                                          */
      __IM  uint32_t disable_cck : 1;           /*!< [25..25] BD_OPT1 = Disable_CCK                                            */
      __IM  uint32_t ext_clk    : 1;            /*!< [26..26] BD_OPT2 = EXT_CLK                                                */
      __IM  uint32_t ext_rstb   : 1;            /*!< [27..27] BD_OPT3 = EXT_RSTB                                               */
      __IM  uint32_t            : 2;
      __IM  uint32_t chip_en    : 1;            /*!< [30..30] CHIP_EN PIN input value                                          */
      __IM  uint32_t syscfg_bd_pkg_sel : 1;     /*!< [31..31] Trapped PKG_ENG_SEL value 0: normal package; 1: engineering
                                                     mode                                                                      */
    } sys_system_cfg0_b;
  } ;
  
  union {
    __IOM uint32_t sys_system_cfg1;             /*!< (@ 0x000001F4) System Configuration Register1                             */
    
