pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t soc_anaclk_sdio_dev_en : 1;/*!< [0..0] 1: enable SDIO_DEV ANA clock                                       */
      __IOM uint32_t soc_pclk_sdio_dev_en : 1;  /*!< [1..1] 1; enable SDIO_DEV H clock                                         */
    } pesoc_hci_clk_ctrl0_b;
  } ;
  
  union {
    __IOM uint32_t pesoc_com_clk_ctrl1;         /*!< (@ 0x00000244) SOC Common Clock Enable Control Register                   */
    
    struct {
      __IOM uint32_t soc_wl_anaclk_en : 1;      /*!< [0..0] 1: enable WL ANA clock                                             */
      __IOM uint32_t soc_wl_axiclk_en : 1;      /*!< [1..1] 1: enable WL AXI clock                                             */
      __IOM uint32_t soc_wl_32k_en : 1;         /*!< [2..2] 1: enable WL 32K clock                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t soc_clk_security_eng_en : 1;/*!< [4..4] 1: enable security engine clock                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t soc_32kclk_bt_en : 1;      /*!< [8..8] 1: enable BT 32kHz clock                                           */
      __IOM uint32_t soc_40mclk_bt_en : 1;      /*!< [9..9] 1: enable BT 40MHz clock                                           */
    } pesoc_com_clk_ctrl1_b;
  } ;
  __IM  uint32_t  RESERVED19[2];
  
  union {
    __IOM uint32_t pesoc_clk_sel;               /*!< (@ 0x00000250) Peripheral Clock Selection Register                        */
    
    struct {
      __IM  uint32_t            : 16;
      __IOM uint32_t pesoc_ck_scale : 2;        /*!< [17..16] PLL clock divided by N: 2b'00: N=1, 2b'01: N=2 (/2),
                                                     2b'02: N=4 (/4)                                                           */
    } pesoc_clk_sel_b;
  } ;
  __IM  uint32_t  RESERVED20[45];
  
  union {
    __IOM uint32_t pesoc_peri_ctrl;             /*!< (@ 0x00000308) SOC Peripheral Control Register                            */
    
    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t soc_func_spi_rn : 1;       /*!< [8..8] 1: master 0: slave                                                 */
    } pesoc_peri_ctrl_b;
  } ;
  __IM  uint32_t  RESERVED21[5];
  
  union {
    __IOM uint32_t rm_cfg0;                     /*!< (@ 0x00000320) Read Margin Configuration Register0                        */
    
    struct {
      __IOM uint32_t rm_synopsys_platform_120 : 4;/*!< [3..0] read margins                                                     */
      __IOM uint32_t rm_synopsys_bt_40 : 4;     /*!< [7..4] read margins                                                       */
      __IOM uint32_t rm_synopsys_wlbb_80 : 4;   /*!< [11..8] read margins                                                      */
      __IOM uint32_t rm_synopsys_wlbb_160 : 4;  /*!< [15..12] read margins                                                     */
      __IOM uint32_t rm_rtk_platform_120 : 4;   /*!< [19..16] read margins                                                     */
      __IOM uint32_t rm_rtk_dtcm_120 : 4;       /*!< [23..20] read margins                                                     */
      __IOM uint32_t rm_synopsys_wlmac_40 : 4;  /*!< [27..24] read margins                                                     */
      __IOM uint32_t rm_synopsys_wlmac_160 : 4; /*!< [31..28] read margin of wlamac 160hz memory.                              */
    } rm_cfg0_b;
  } ;
  
  union {
    __IOM uint32_t rm_cfg1;                     /*!< (@ 0x00000324) Read Margin Configuration Register1                        */
    
    struct {
      __IOM uint32_t rm_synopsys_wlmac_60 : 4;  /*!< [3..0] read margins                                                       */
      __IOM uint32_t rm_synopsys_sdio : 4;      /*!< [7..4] read margins                                                       */
      __IOM uint32_t rm_synopsys_share : 4;     /*!< [11..8] read margins                                                      */
      __IOM uint32_t rm_synopsys_bt_rom : 4;    /*!< [15..12] read margins                                                     */
      __IOM uint32_t rm_synopsys_itcm_rom : 4;  /*!< [19..16] read margins                                                     */
      __IOM uint32_t rm_synopsys_wmac_rom : 4;  /*!< [23..20] read margins                                                     */
    } rm_cfg1_b;
  } ;
  
  union {
    __IOM uint32_t rme_cfg;                     /*!< (@ 0x00000328) Read Margin Enable Configuration Register                  */
    
    struct {
      __IOM uint32_t rme_synopsys_platform_120 : 1;/*!< [0..0] rme_synopsys_platform_120                                       */
      __IOM uint32_t rme_synopsys_bt_80 : 1;    /*!< [1..1] rme_synopsys_bt_80                                                 */
      __IOM uint32_t rme_synopsys_wlbb_80 : 1;  /*!< [2..2] rme_synopsys_wlbb_80                                               */
      __IOM uint32_t rme_synopsys_wlbb_160 : 1; /*!< [3..3] rme_synopsys_wlbb_160                                              */
      __IOM uint32_t saw_rtk_platform_120 : 2;  /*!< [5..4] saw_rtk_platform_120                                               */
      __IOM uint32_t saw_rtk_dtcm_120 : 2;      /*!< [7..6] saw_rtk_dtcm_120                                                   */
      __IOM uint32_t rme_synopsys_wlmac_40 : 1; /*!< [8..8] rme_synopsys_wlmac_40                                              */
      __IOM uint32_t rme_synopsys_wlmac_160 : 1;/*!< [9..9] rme_synopsys_wlmac_160                                             */
      __IOM uint32_t rme_synopsys_wlmac_60 : 1; /*!< [10..10] rme_synopsys_wlmac_60                                            */
      __IOM uint32_t rme_synopsys_sdio : 1;     /*!< [11..11] rme_synopsys_sdio                                                */
      __IOM uint32_t rme_synopsys_share : 1;    /*!< [12..12] rme_synopsys_share                                               */
      __IOM uint32_t rme_synopsys_bt_rom : 1;   /*!< [13..13] rme_synopsys_bt_rom                                              */
      __IOM uint32_t rme_synopsys_itcm_rom : 1; /*!< [14..14] rme_synopsys_itcm_rom                                            */
      __IOM uint32_t rme_synopsys_wlmac_rom : 1;/*!< [15..15] rme_synopsys_wlmac_rom                                           */
    } rme_cfg_b;
  } ;
  __IM  uint32_t  RESERVED22[50];
  
  union {
    __IOM uint32_t peon_status;                 /*!< (@ 0x000003F4) Peripheral On Status Register                              */
    
