pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson.h
    struct {
      __IOM uint32_t peon_sdio_aldn : 1;        /*!< [0..0] 1: SDIO Config autoload done; 0: autoload not ready                */
    } peon_status_b;
  } ;
} SYSON_Type;                                   /*!< Size = 1016 (0x3f8)                                                       */



/* =========================================================================================================================== */
/* ================                                          SYSON_S                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief System Secure Region Control (SYSON_S)
  */

typedef struct {                                /*!< (@ 0x50000800) SYSON_S Structure                                          */
  
  union {
    __IOM uint32_t sce_clk_ctrl;                /*!< (@ 0x00000000) SCE Clock Control Register                                 */
    
    struct {
      __IOM uint32_t flash_sce_clk_en : 1;      /*!< [0..0] 1: Enable flash SCE CLK                                            */
    } sce_clk_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t sce_func_ctrl;               /*!< (@ 0x00000004) SCE Function Control Register                              */
    
    struct {
      __IOM uint32_t flash_sce_en : 1;          /*!< [0..0] 1: Enable flash SCE                                                */
    } sce_func_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t sec_attr_ctrl;               /*!< (@ 0x00000008) Peripheral device secure attribure control register        */
    
    struct {
      __IOM uint32_t wlan_sec_en : 1;           /*!< [0..0] WLAN secure attribute configuration: 0: WLan is a non-secure
                                                     device 1: WLan is a secure device                                         */
      __IOM uint32_t sdio_sec_en : 1;           /*!< [1..1] SDIO device secure attribute configuration: 0: SDIO device
                                                     is a non-secure device 1: SDIO device is a secure device                  */
    } sec_attr_ctrl_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t sce_flash_ctrl0;             /*!< (@ 0x00000010) SCE Flash Control Register 0                               */
    
    struct {
      __IOM uint32_t sce_flash_op_addr : 8;     /*!< [7..0] When you want to read or write data from or to SCE register,
                                                     you need to fill the address to this register at first.
                                                     Uint: 4 bytes Ex: REG_SECURE_CTRL[7:0] = 0x2 represent
                                                     that SCE register is 0x08.                                                */
    } sce_flash_ctrl0_b;
  } ;
  
  union {
    __IOM uint32_t sce_flash_ctrl1;             /*!< (@ 0x00000014) SCE Flash Control Register 1                               */
    
    struct {
      __IOM uint32_t sce_flash_op_data : 32;    /*!< [31..0] There are two operation in this register. One is reading
                                                     process and the other is writing process. Reading Process:
                                                     read data from SCE register according to REG_SCE_CONFIG[7:0].
                                                     Writing Process: write data to SCE register according to
                                                     REG_SCE_CONFIG[7:0].                                                      */
    } sce_flash_ctrl1_b;
  } ;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t sec_efuse_ctrl0;             /*!< (@ 0x00000020) SCE eFuse Control Register 0                               */
    
    struct {
      __IOM uint32_t sec_ef_data : 8;           /*!< [7..0] Access Data                                                        */
      __IOM uint32_t sec_ef_addr : 10;          /*!< [17..8] Access Address                                                    */
      __IM  uint32_t            : 13;
      __IOM uint32_t sec_ef_rwflag : 1;         /*!< [31..31] Write 1 for Program; Write 0 for Read Access                     */
    } sec_efuse_ctrl0_b;
  } ;
} SYSON_S_Type;                                 /*!< Size = 36 (0x24)                                                          */


/** @} */ /* End of group hal_syson_reg */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup syson_peripheralAddr SysOn Registers Base Address
  * @ingroup hs_hal_syson
  * @{
  */

#define SYSON_BASE                  0x40000000UL
#define SYSON_S_BASE                0x50000800UL

/** @} */ /* End of group syson_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup syson_type_declaration SysOn Device Type
  * @ingroup hs_hal_syson
  * @{
  */

#define SYSON                       ((SYSON_Type*)             SYSON_BASE)
#define SYSON_S                     ((SYSON_S_Type*)           SYSON_S_BASE)

/** @} */ /* End of group syson_type_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif

#include "rtl8710c_syson_type.h"
#include "rtl8710c_syson_s_type.h"

/**
  \brief  The data structure to export the SysOn API functions in ROM.
*/
typedef struct hal_syson_func_stubs_s {
    uint32_t (*hal_syson_query_sys_clk) (void);
    void (*hal_syson_set_sys_clk) (sys_clock_rate_t sys_clk);
    void (*hal_syson_reg_wake_event_handler) (sys_wake_event_t event, syson_irq_handler_t handler, uint32_t arg);
    void (*hal_syson_unreg_wake_event_handler) (sys_wake_event_t event);
    void (*hal_syson_enable_wake_event) (sys_wake_event_t event);
    void (*hal_syson_disable_wake_event) (sys_wake_event_t event);
    void (*hal_syson_reg_irq) (int_vector_t handler);
    void (*hal_syson_init) (hal_syson_adapter_t *psyson_adp);

    // B-Cut
    hal_status_t (*hal_sys_set_fast_boot) (uint32_t pstart_tbl, uint32_t func_idx);
    uint32_t reserved[15];  // reserved space for next ROM code version function table extending.
} hal_syson_func_stubs_t;

/**
 * @addtogroup hs_hal_syson_rom_func
 * @{
 */

void hal_syson_sys_clk_sel_rtl8710c (uint32_t clk_src, uint32_t clk_sel);
void hal_syson_sys_clk_div_rtl8710c (uint32_t dev_en, uint32_t dev_sel);
uint32_t hal_syson_query_sys_clk_rtl8710c (void);
void hal_syson_set_sys_clk_rtl8710c (sys_clock_rate_t sys_clk);
void hal_syson_reg_wake_event_handler_rtl8710c (sys_wake_event_t event, syson_irq_handler_t handler, uint32_t arg);
void hal_syson_unreg_wake_event_handler_rtl8710c (sys_wake_event_t event);
void hal_syson_enable_wake_event_rtl8710c (sys_wake_event_t event);
void hal_syson_disable_wake_event_rtl8710c (sys_wake_event_t event);
void hal_syson_reg_irq_rtl8710c (int_vector_t handler);
void hal_syson_init_rtl8710c (hal_syson_adapter_t *psyson_adp);
hal_status_t hal_sys_set_fast_boot_rtl8710c (uint32_t pstart_tbl, uint32_t func_idx);

/** @} */ /* End of group hs_hal_syson_rom_func */
/** @} */ /* End of group rtl8710c_syson */
   
/// @endcond /* End of condition DOXYGEN_SYSON_REG_TYPE */
    

#ifdef __cplusplus
}
#endif

#endif /* RTL8710C_SYSON_H */

